### 1.데이터 가져오기 customerData

In [104]:
import pandas as pd

customerData = pd.read_csv("../dataset/customerdata.csv")

customerData.columns = ['Unnamed','CUSTID','AVGPRICE','EMI','DEVICECOUNT','PRODUCTAGE','CUSTTYPE']

customerData = pd.DataFrame(customerData)


answer1 = customerData[ (customerData.EMI==3) & (customerData.DEVICECOUNT>5)]
answer1.head(2)

,Unnamed,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE
0,0,A13566,4273.900000,3,6.4,1.679181,Big-Screen-lover
27,27,F17131,3179.708359,3,6.5,1.100000,Early-bird

In [9]:
customerData.dtypes

Unnamed          int64
CUSTID          object
AVGPRICE       float64
EMI              int64
DEVICECOUNT    float64
PRODUCTAGE     float64
CUSTTYPE        object
dtype: object

In [105]:
customerData["DEVICECOUNT"] = customerData["DEVICECOUNT"].astype(int)
print(customerData.dtypes)
customerData.head()

Unnamed          int64
CUSTID          object
AVGPRICE       float64
EMI              int64
DEVICECOUNT      int32
PRODUCTAGE     float64
CUSTTYPE        object
dtype: object

,Unnamed,CUSTID,AVGPRICE,EMI,DEVICECOUNT,PRODUCTAGE,CUSTTYPE
0,0,A13566,4273.900000,3,6,1.679181,Big-Screen-lover
1,1,A14219,3642.441950,2,4,2.682023,Sleeping-dog
2,2,A15312,3653.884565,2,5,3.208202,Sleeping-dog
3,3,A16605,3713.211107,2,6,0.900000,Early-bird
4,4,B10634,3391.074215,2,4,2.453656,Sleeping-dog

### 2.인도 퀴즈 kopo_customerdata 가져오기

In [84]:
import pandas as pd
kopo_customerdata = pd.read_csv("../dataset/kopo_customerdata.csv")
kopo_customerdata
answer2 = kopo_customerdata[ ( kopo_customerdata.GENDER == "Male") & (kopo_customerdata.EMAIL > 0)]
answer2.head(3)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
16,1154228,State2,2,Male,0,1,1,0,18200,0,0,18200,0,0,1,0
81,393246,State2,2,Male,0,1,1,1,18200,0,0,18200,0,0,1,0

In [77]:
kopo_customerdata.dtypes

CUSTOMERCODE      int64
STATENAME        object
ST                int64
GENDER           object
DOB               int64
GENDER1           int64
EMAIL             int64
FEST_CNT          int64
TOTAL_AMOUNT      int64
AC_AMOUNT         int64
AV_AMOUNT         int64
HA_AMOUNT         int64
EMI_CE_AMOUNT     int64
IS_HIGHEND        int64
CNT_VIST          int64
GAP_VISIT         int64
dtype: object

In [78]:
targetGender = "Male"
targetGender = targetGender.upper()
targetGender

'MALE'

In [87]:
targetEmail = 0
targetEmail

0

In [89]:
answer2 = kopo_customerdata[ ( kopo_customerdata.GENDER.str.upper() == targetGender) &
                            (kopo_customerdata.EMAIL > targetEmail)]
answer2.head(4)

,CUSTOMERCODE,STATENAME,ST,GENDER,DOB,GENDER1,EMAIL,FEST_CNT,TOTAL_AMOUNT,AC_AMOUNT,AV_AMOUNT,HA_AMOUNT,EMI_CE_AMOUNT,IS_HIGHEND,CNT_VIST,GAP_VISIT
0,1503989,State2,2,Male,0,1,1,0,30300,0,30300,0,0,0,1,0
16,1154228,State2,2,Male,0,1,1,0,18200,0,0,18200,0,0,1,0
81,393246,State2,2,Male,0,1,1,1,18200,0,0,18200,0,0,1,0
206,2532568,State2,2,Male,1,1,1,0,48000,48000,0,0,0,0,1,0

### 3.kopo_product_volume 불러오기

In [69]:
import pandas as pd
aa = pd.read_csv("../dataset/kopo_product_volume.csv")
aa.head(2)

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201415  810144
1      A01       ST0002    201415  128999

In [106]:
answer3 = aa[ (aa.PRODUCTGROUP.str.upper() == productgroup) & (aa.VOLUME > volume) ]
answer3
##.str.upper()는 어딘가 누락된 소문자인 데이터를 대문자로 바꿔 누락을 최소화 한다.

    REGIONID PRODUCTGROUP  YEARWEEK   VOLUME
80       A01       ST0002    201452   422468
86       A01       ST0002    201451   356271
90       A01       ST0002    201449   669711
94       A01       ST0002    201447   378339
102      A01       ST0002    201448  1400339
196      A01       ST0002    201552   422468
208      A01       ST0002    201551   356271
212      A01       ST0002    201549   669711
216      A01       ST0002    201547   378339
224      A01       ST0002    201548  1400339

In [75]:
aa.dtypes

REGIONID        object
PRODUCTGROUP    object
YEARWEEK         int64
VOLUME           int64
dtype: object

In [99]:
productgroup = "st0002"
productgroup=productgroup.upper()
productgroup

'ST0002'

In [93]:
volume = 300000
volume

300000